app/views/templates/index.html.slim

  tbody
    - @templates.includes(:tag_type).reorder(tag_type_id: :asc, name: :asc).each do |template|
---
SELECT "tag_types".* FROM "tag_types" WHERE "tag_types"."id" IN (1, 2, 3, 4)