app/views/sign_ups/_plans_list.html.slim

SELECT "plans".* FROM "plans"
---
        .row.justify-content-center
          - Plan.all.each do |plan_obj|
            .col-4.pr-1.pl-1.card-holder
              .bg-white.border.rounded
                .col-12.mt-2.mb-2
                  .pb-4
                  .row.justify-content-center.pb-4