app/views/sign_ups/_product.html.slim

SELECT  "plans".* FROM "plans" WHERE "plans"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  = image_tag 'product-phone-2.png'
  - @plan = Plan.find(session[:plan_id])