app/views/users/index.html.slim

SELECT  "user_stable_roles".* FROM "user_stable_roles" WHERE "user_stable_roles"."deleted_at" IS NULL AND "user_stable_roles"."user_id" = $1 AND "user_stable_roles"."stable_id" = 1 ORDER BY "user_stable_roles"."id" ASC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
---
          - if user.is_horse_restricted_in_stable?(current_stable)
            = link_to image_tag('horse.svg', class: 'icon'), edit_user_stable_role_path(user.user_stable_roles.where(stable:current_stable).first)