app/views/tags/index.html.slim

  tbody
    - @tags.includes(:tag_type).reorder(tag_type_id: :asc, tag_name: :asc).each do |tag|
---
SELECT "tag_types".* FROM "tag_types" WHERE "tag_types"."id" IN (1, 2, 3, 4)