app/views/my_lists/_form.html.slim

SELECT "horses".* FROM "horses" WHERE "horses"."deleted_at" IS NULL AND "horses"."stable_id" = $1  [["stable_id", 1]]
---
      .col-sm
        =f.input :horses, label: false, collection: current_stable.horses, input_html: {class: 'form-control multipleSelect', 'data-1st-placeholder': translate('my_lists.available_horses'), 'data-2nd-placeholder': translate('my_lists.selected_horses')}