app/controllers/sign_ups_controller.rb

INSERT INTO "users" ("name", "email", "crypted_password", "password_salt", "persistence_token", "single_access_token", "perishable_token", "login_count", "last_request_at", "current_login_at", "current_login_ip", "created_at", "updated_at", "public_updated_at", "stripe_id", "phone", "address", "zip", "city", "country", "firstname", "lastname") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22) RETURNING "id"
SELECT  "plans".* FROM "plans" WHERE "plans"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def update
    case step
      when :select_plan
        session[:plan_id] = params[:submit]
        puts  session[:plan_id]
        jump_to :basic_details
      when :basic_details
        session[:selected_stable_type] = params[:selected_stable_type]
        session[:user_params] = user_params
        session[:country] = session[:user_params]['country']
        @user.assign_attributes(user_params)
        session[:generated_password] = random_string(8)
        @user.assign_attributes(password: session[:generated_password], password_confirmation: session[:generated_password])
        @user.assign_attributes(name: user_params[:firstname] + " " + user_params[:lastname])
        unless @user.validate(:trainer)
          jump_to :basic_details
          @object = @user
        else
          jump_to :payment
        end
      when :payment
        token = params[:stripeToken]
        coupon = params[:user][:coupon]
        check_valid_coupon = params[:user][:check_applied]
        begin
          # Create a Customer:
          customer = Stripe::Customer.create(
            :email => @user.email,
            :source => token
          )
          stripe_plan_id = Plan.find(session[:plan_id]).details

INSERT INTO "stables" ("name", "address", "telephone", "zip", "city", "trainer_id", "created_at", "updated_at", "active", "cvr", "locale", "plan_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
INSERT INTO "user_stable_roles" ("user_id", "stable_id", "role", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 41], ["stable_id", 35], ["role", "trainer"], ["created_at", "2020-07-09 07:13:07.546438"], ["updated_at", "2020-07-09 07:13:07.546438"]]
---
              plan_id: session[:plan_id],
              trainer_id: user.id
          )
          stable.save

          user.user_stable_roles << UserStableRole.new(stable: stable, role: 'trainer')