app/controllers/terms_controller.rb

  def accept_terms
    if current_user.update_attribute(:terms_accepted, true)
---
UPDATE "users" SET "perishable_token" = $1, "last_request_at" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["perishable_token", "KzXZZNGRLyWJoVI761a2"], ["last_request_at", "2020-07-09 07:14:02.570121"], ["updated_at", "2020-07-09 07:14:02.577690"], ["id", 41]]