app/views/layouts/_stable_name_and_selection.html.slim

    strong=translate('general.active_stable') + ':'+'&nbsp;'.html_safe
    - stables = Stable.joins(:user_stable_roles).where(active: true, user_stable_roles: {user_id: current_user.id}).order(name: :asc)
---
SELECT  "user_stable_roles".* FROM "user_stable_roles" INNER JOIN "stables" ON "stables"."id" = "user_stable_roles"."stable_id" AND "stables"."deleted_at" IS NULL WHERE "user_stable_roles"."deleted_at" IS NULL AND "user_stable_roles"."user_id" = $1 AND "user_stable_roles"."role" IN ('trainer', 'employee') AND "stables"."active" = $2 ORDER BY stables.name asc LIMIT $3  [["user_id", 11], ["active", "t"], ["LIMIT", 1]]